## Steps of Data Wrangling

### Dealing with missing values

.in a data set missing values can be : N/A, NaN, Blank cell, 0.

.missing values are the first and foremost the most imp step.

### Remedials for missing values

.Collest data again if possible.

.remove that column if not so imp.

.replace missing values as follows:

....Average value of entire variable or similar data point.

....frequency or Mode replacement.

....Replace based on other functions...(data sampler knows that)

....ML algorithm can also b used.

....Leave it like that.

why?

...its better because no data is lost.

 ...Less accurate.

In [8]:
# all installed seperately dont know why not installing all together

pip install numpy
pip install pandas
pip install seaborn

Requirement already satisfied: numpy in c:\users\cc\appdata\local\programs\python\python311\lib\site-packages (1.23.4)
Note: you may need to restart the kernel to use updated packages.

In [9]:
# import packages

import pandas as pd
import seaborn as sns
import numpy as np

In [12]:
kashti = sns.load_dataset('titanic')
ks1 = kashti
ks2 = kashti

In [13]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
# Find missing values

kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [17]:
# use drop.na method to drop null values
print(kashti.shape)
kashti.dropna(subset=['deck'], axis=0, inplace=True)

(891, 15)

In [18]:
# after dropna method 
print(kashti.shape)

(203, 15)

In [19]:
# check null values
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [20]:
# drop na values

kashti = kashti.dropna()
kashti.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [21]:
print(kashti.shape)

(182, 15)

## Replace missing values 2.method

.replacing missing values with the average of that column.

In [25]:
ks1 = sns.load_dataset('titanic')
ks1.shape

(891, 15)

In [26]:
mean = ks1['age'].mean()
mean

29.69911764705882

In [28]:
# replacing with mean values

ks1['age'] = ks1['age'].replace(np.nan, mean) # np.nan is array method of numpy

In [29]:
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

assingment replace deck values with average and embark removal of values.

## Data formatting (step of data wrrangling)

also called duplicate removal, data standardization, data cleaning

.Bring all data in single format .....(eg: khi, multan, fsd)

.Ensure data is consistent and understandable ...

....Easy to gather

....Easy to work with

.......eg : height in cm and ft

In [30]:
# know the data types and convert them into known ones

ks1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [31]:
# method to convert data type

ks1['survived'] = ks1['survived'].astype("float64")
ks1.dtypes

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [32]:
# simple type conversion
# assign. remove extra zeros after decimal

ks1['age'] = ks1['age']*365
ks1.rename(columns={"age" : "age in days"},inplace=True)
ks1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3,male,8030.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3,female,9490.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3,male,12775.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
# assignment

ks1['age in days'] = ks1['age in days'].astype("int64")
ks1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3,male,8030,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3,female,9490,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1.0,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3,male,12775,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Data Normalisation (24:27) to be continued

## Binning 
Last topic of this vid. chapter...left due to shortage of time will cover later.